regression2/t_writes-innodb-multi/mariadb-10.0.38/sysbench.128.res
sysbench 0.5:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 128
Report intermediate results every 3 second(s)
Random number generator seed is 0 and will be ignored

Forcing shutdown in 181 seconds

Threads started!

[   3s] threads: 128, tps: 7556.10, reads: 0.00, writes: 151679.60, response time: 29.27ms (95%), errors: 9.67, reconnects:  0.00
[   6s] threads: 128, tps: 7999.98, reads: 0.00, writes: 160223.23, response time: 25.50ms (95%), errors: 7.00, reconnects:  0.00
[   9s] threads: 128, tps: 8594.03, reads: 0.00, writes: 171671.61, response time: 24.15ms (95%), errors: 8.33, reconnects:  0.00
[  12s] threads: 128, tps: 8696.33, reads: 0.00, writes: 174206.66, response time: 23.51ms (95%), errors: 12.00, reconnects:  0.00
[  15s] threads: 128, tps: 8883.66, reads: 0.00, writes: 177765.54, response time: 22.90ms (95%), errors: 12.33, reconnects:  0.00
[  18s] threads: 128, tps: 8843.01, reads: 0.00, writes: 176945.12, response time: 22.99ms (95%), errors: 11.00, reconnects:  0.00
[  21s] threads: 128, tps: 8725.34, reads: 0.00, writes: 174842.52, response time: 23.23ms (95%), errors: 7.67, reconnects:  0.00
[  24s] threads: 128, tps: 8878.66, reads: 0.00, writes: 177479.83, response time: 22.69ms (95%), errors: 9.00, reconnects:  0.00
[  27s] threads: 128, tps: 8606.00, reads: 0.00, writes: 172394.61, response time: 23.78ms (95%), errors: 10.33, reconnects:  0.00
[  30s] threads: 128, tps: 8732.68, reads: 0.00, writes: 174654.50, response time: 23.08ms (95%), errors: 11.33, reconnects:  0.00
[  33s] threads: 128, tps: 8856.96, reads: 0.00, writes: 177327.18, response time: 23.00ms (95%), errors: 12.67, reconnects:  0.00
[  36s] threads: 128, tps: 8570.70, reads: 0.00, writes: 171377.09, response time: 24.06ms (95%), errors: 9.33, reconnects:  0.00
[  39s] threads: 128, tps: 8537.33, reads: 0.00, writes: 170908.69, response time: 24.41ms (95%), errors: 12.00, reconnects:  0.00
[  42s] threads: 128, tps: 8588.33, reads: 0.00, writes: 171951.98, response time: 23.66ms (95%), errors: 10.00, reconnects:  0.00
[  45s] threads: 128, tps: 8763.00, reads: 0.00, writes: 175217.30, response time: 23.49ms (95%), errors: 10.33, reconnects:  0.00
[  48s] threads: 128, tps: 8638.33, reads: 0.00, writes: 173024.66, response time: 23.83ms (95%), errors: 10.33, reconnects:  0.00
[  51s] threads: 128, tps: 8256.34, reads: 0.00, writes: 165346.05, response time: 24.41ms (95%), errors: 8.33, reconnects:  0.00
[  54s] threads: 128, tps: 8692.67, reads: 0.00, writes: 173730.31, response time: 23.64ms (95%), errors: 8.67, reconnects:  0.00
[  57s] threads: 128, tps: 8510.67, reads: 0.00, writes: 170617.05, response time: 24.35ms (95%), errors: 9.33, reconnects:  0.00
[  60s] threads: 128, tps: 8639.00, reads: 0.00, writes: 172595.65, response time: 23.56ms (95%), errors: 10.00, reconnects:  0.00
[  63s] threads: 128, tps: 7940.00, reads: 0.00, writes: 158865.66, response time: 24.40ms (95%), errors: 9.33, reconnects:  0.00
[  66s] threads: 128, tps: 8155.66, reads: 0.00, writes: 163390.29, response time: 23.89ms (95%), errors: 9.67, reconnects:  0.00
[  69s] threads: 128, tps: 8272.01, reads: 0.00, writes: 165240.45, response time: 24.52ms (95%), errors: 8.33, reconnects:  0.00
[  72s] threads: 128, tps: 7869.99, reads: 0.00, writes: 157710.20, response time: 23.95ms (95%), errors: 6.00, reconnects:  0.00
[  75s] threads: 128, tps: 7981.00, reads: 0.00, writes: 159780.38, response time: 23.78ms (95%), errors: 10.00, reconnects:  0.00
[  78s] threads: 128, tps: 7423.00, reads: 0.00, writes: 148704.92, response time: 26.70ms (95%), errors: 6.33, reconnects:  0.00
[  81s] threads: 128, tps: 8000.92, reads: 0.00, writes: 159852.05, response time: 23.82ms (95%), errors: 6.67, reconnects:  0.00
[  84s] threads: 128, tps: 8014.08, reads: 0.00, writes: 160368.30, response time: 25.02ms (95%), errors: 9.33, reconnects:  0.00
[  87s] threads: 128, tps: 7791.00, reads: 0.00, writes: 156194.62, response time: 24.88ms (95%), errors: 9.00, reconnects:  0.00
[  90s] threads: 128, tps: 8138.68, reads: 0.00, writes: 162577.92, response time: 23.74ms (95%), errors: 4.67, reconnects:  0.00
[  93s] threads: 128, tps: 7858.67, reads: 0.00, writes: 157069.01, response time: 24.20ms (95%), errors: 8.67, reconnects:  0.00
[  96s] threads: 128, tps: 8349.30, reads: 0.00, writes: 167193.33, response time: 24.44ms (95%), errors: 11.67, reconnects:  0.00
[  99s] threads: 128, tps: 8520.03, reads: 0.00, writes: 170375.85, response time: 23.67ms (95%), errors: 7.33, reconnects:  0.00
[ 102s] threads: 128, tps: 7992.68, reads: 0.00, writes: 160384.52, response time: 24.19ms (95%), errors: 8.67, reconnects:  0.00
[ 105s] threads: 128, tps: 8231.33, reads: 0.00, writes: 164332.28, response time: 23.75ms (95%), errors: 9.33, reconnects:  0.00
[ 108s] threads: 128, tps: 8087.96, reads: 0.00, writes: 162060.11, response time: 23.90ms (95%), errors: 13.33, reconnects:  0.00
[ 111s] threads: 128, tps: 7762.68, reads: 0.00, writes: 155331.60, response time: 25.18ms (95%), errors: 7.67, reconnects:  0.00
[ 114s] threads: 128, tps: 7940.69, reads: 0.00, writes: 158810.86, response time: 24.59ms (95%), errors: 5.67, reconnects:  0.00
[ 117s] threads: 128, tps: 7809.00, reads: 0.00, writes: 156247.38, response time: 24.70ms (95%), errors: 7.67, reconnects:  0.00
[ 120s] threads: 128, tps: 7784.34, reads: 0.00, writes: 155897.07, response time: 25.46ms (95%), errors: 10.00, reconnects:  0.00
OLTP test statistics:
    queries performed:
        read:                            0
        write:                           20072253
        other:                           2007166
        total:                           22079419
    transactions:                        1003025 (8288.60 per sec.)
    read/write requests:                 20072253 (165869.21 per sec.)
    other operations:                    2007166 (16586.43 per sec.)
    ignored errors:                      1116   (9.22 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          121.0125s
    total number of events:              1003025
    total time taken by event execution: 15486.0945s
    response time:
         min:                                  2.16ms
         avg:                                 15.44ms
         max:                                279.26ms
         approx.  95 percentile:              24.19ms

Threads fairness:
    events (avg/stddev):           7836.1328/35.81
    execution time (avg/stddev):   120.9851/0.01